app/services/air_pollution_importer.rb

  def self.import_data_for_all_locations
    Location.all.each do |location|
---
SELECT "locations".* FROM "locations"

  def self.save_air_pollution_data(location, air_pollution_data)
    Rails.logger.info("Importing air pollution data for location: #{location.name}")

    AirPollutionData.create!(
      aqi: air_pollution_data.dig('list', 0, 'main', 'aqi'),
      co: air_pollution_data.dig('list', 0, 'components', 'co'),
      no2: air_pollution_data.dig('list', 0, 'components', 'no2'),
      o3: air_pollution_data.dig('list', 0, 'components', 'o3'),
      so2: air_pollution_data.dig('list', 0, 'components', 'so2'),
      pm2_5: air_pollution_data.dig('list', 0, 'components', 'pm2_5'),
      pm10: air_pollution_data.dig('list', 0, 'components', 'pm10'),
      location: location
    )
---
INSERT INTO "air_pollution_data" ("location_id", "aqi", "created_at", "updated_at", "co", "no2", "o3", "so2", "pm2_5", "pm10") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"