lib/tasks/fetch_locations.rake

  task :execute do
    api_key = ENV['OPENWEATHERMAP_API_KEY']
    geocoding_service = GeocodingService.new(api_key)

    cities = ['Mumbai', 'Delhi', 'Bangalore', 'Kolkata', 'Chennai', 'Hyderabad', 'Ahmedabad', 'Pune', 'Surat', 'Jaipur', 'Lucknow', 'Kanpur', 'Nagpur', 'Indore', 'Thane', 'Bhopal', 'Visakhapatnam', 'Pimpri-Chinchwad', 'Patna', 'Vadodara']

    cities.each do |city_name|
      location_data = geocoding_service.fetch_location(city_name)
      Location.create(location_data)
---
INSERT INTO "locations" ("name", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Mumbai"], ["latitude", 19.0785451], ["longitude", 72.878176], ["created_at", "2023-12-11 15:21:27.895750"], ["updated_at", "2023-12-11 15:21:27.895750"]]