lib/tasks/repopulate_locations.rake

SELECT "locations".* FROM "locations" ORDER BY "locations"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  task :repopulate_locations => :environment do
    Location.find_each do |location|