app/controllers/air_pollution_controller.rb

  def index
    # @air_pollution_data = AirPollutionData.where(location_id: @location.id).last
    # render json: @air_pollution_data
     # Make API request to OpenWeatherMap
     location = Location.find(params[:location_id])

    # Ensure that the location is found before making the API request
    if location.present?
      latitude = location.latitude
      longitude = location.longitude

      # Make API request to OpenWeatherMap
      response = RestClient.get("https://api.openweathermap.org/data/2.5/air_pollution?lat=#{latitude}&lon=#{longitude}&appid=#{ENV['OPENWEATHERMAP_API_KEY']}")

      # Parse and process the API response
      data = JSON.parse(response.body)
      aqi = data['list'].first['main']['aqi']

      # Create or update AirPollutionData record
      AirPollutionData.create(location_id: location.id, aqi: aqi)
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "air_pollution_data" ("location_id", "aqi", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["location_id", 3], ["aqi", 4], ["created_at", "2023-12-10 14:03:20.421460"], ["updated_at", "2023-12-10 14:03:20.421460"]]

  def set_location
    @location = Location.find(params[:location_id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]